{
	"modules": [
		{
			"name": "BT4013",
			"moduleCode": "BT",
			"semester": "Y3S1",
			"title": "Analytics for Capital Market Trading and Investment",
			"description": "This course broadly covers quantitative trading, focusing on strategies built through time-series analysis. Techniques for identifying trading opportunities by sifting through historical data will be explored. The course also addresses the quantification of risk associated with potential trading decisions.",
			"review": null,
			"grade": "A+",
			"type": "BZA",
			"moduleCredit": 4.0
		},
		{
			"name": "BT4012",
			"moduleCode": "BT",
			"semester": "Y3S1",
			"title": "Fraud Analytics",
			"description": "Anomaly detection, data preparation, deep learning applications",
			"review": null,
			"grade": "A",
			"type": "BZA",
			"moduleCredit": 4.0
		},
		{
			"name": "CP3880",
			"moduleCode": "CP",
			"semester": "Y3S1",
			"title": "ATAP (Advanced Technology Attachment Programme)",
			"description": "Internship",
			"review": null,
			"grade": "CS",
			"type": "BZA",
			"moduleCredit": 12.0
		},
		{
			"name": "ST2334",
			"moduleCode": "ST",
			"semester": "Y2S2",
			"title": "Probability and Statistics",
			"description": "Introduction to Basic probability theory and statistical inference. Topics include basic concepts of probability, conditional probability, independence, random variables, joint and marginal distributions, mean and variance, some common probability distributions, sampling distributions, estimation and hypothesis testing based on a normal population.",
			"review": null,
			"grade": "A+",
			"type": "BZA",
			"moduleCredit": 4.0
		},
		{
			"name": "IS3103",
			"moduleCode": "IS",
			"semester": "Y2S2",
			"title": "Information Systems Leadership and Communication",
			"description": "Encompasses the strategic, tactical, and operational aspects of managing and leading IT adoption, implementation, and organizational change to derive strategic value from IT.",
			"review": null,
			"grade": "A-",
			"type": "BZA",
			"moduleCredit": 4.0
		},
		{
			"name": "FIN3702A",
			"moduleCode": "FIN",
			"semester": "Y2S2",
			"title": "Investment Analysis and Portfolio Management",
			"description": "Comprehensive coverage of basic concepts, theories, applications and decision-making rules in financial investment. Fundamental security analysis on stocks, bonds, options and futures as well as modern portfolio management.",
			"review": null,
			"grade": "A+",
			"type": "BBA",
			"moduleCredit": 4.0
		},
		{
			"name": "DAO2703",
			"moduleCode": "DAO",
			"semester": "Y2S2",
			"title": "Operations and Technology Management",
			"description": "Foundational topics of operations and highlights the relevance and strategic significance of technology and the operations function in enterprises",
			"review": null,
			"grade": "CS",
			"type": "BBA",
			"moduleCredit": 4.0
		},
		{
			"name": "BT3103",
			"moduleCode": "BT",
			"semester": "Y2S2",
			"title": "Application Systems Development for Business Analytics",
			"description": "Focuses heavily on the development and deployment of web applications",
			"review": null,
			"grade": "B+",
			"type": "BZA",
			"moduleCredit": 4.0
		},
		{
			"name": "BT3102",
			"moduleCode": "BT",
			"semester": "Y2S2",
			"title": "Computational Methods for Business Analytics",
			"description": "Computational methods, algorithms and techniques used in business fields such as finance, marketing and economics to address complex analytics problems.",
			"review": null,
			"grade": "A",
			"type": "BZA",
			"moduleCredit": 4.0
		},
		{
			"name": "Personal Website",
			"moduleCode": null,
			"semester": "Y2S1",
			"title": null,
			"description": null,
			"review": null,
			"grade": null,
			"type": null,
			"moduleCredit": null
		},
		{
			"name": "RC4 FA",
			"moduleCode": null,
			"semester": "Y2S1",
			"title": null,
			"description": null,
			"review": null,
			"grade": null,
			"type": null,
			"moduleCredit": 0.0
		},
		{
			"name": "UTC2709",
			"moduleCode": "UTC",
			"semester": "Y2S1",
			"title": "Causality and Natural Experiments",
			"description": "Introduction to the fundamentals of econometrics and establishing causality",
			"review": "Took this module with BT2101 which also taught econometrics, be it through a more quantitative lens. This module provided greater insight and depth into the subject matter at hand in terms of why and how certain models in econometrics are derived and how they should be treated.",
			"grade": "S",
			"type": "Both",
			"moduleCredit": 4.0
		},
		{
			"name": "IS2218",
			"moduleCode": "IS",
			"semester": "Y2S1",
			"title": "Digital Platforms for Business",
			"description": "A module taken to fulfil the requirement of an interdisciplinary module. This module overlaps significantly with my modules from my Business degree, teaching broadly the concepts across the spectrum of Business.",
			"review": "Taking this module in Year 2 with the knowledge of accounting already at the back of my mind, I was able to breeze through this module for the most part, learning extra details about business platforms on the way.",
			"grade": "A",
			"type": "BZA",
			"moduleCredit": 4.0
		},
		{
			"name": "BSP2701",
			"moduleCode": "BSP",
			"semester": "Y2S1",
			"title": "Global Economy",
			"description": "An introduction to macroeconomics and international economics, with a simple dive into analytical frameworks for real-world events.",
			"review": "An introduction to macroeconomics with a little extra content added on top of what we already knew at the H2 Economics level taught in JC.",
			"grade": "A",
			"type": "BBA",
			"moduleCredit": 2.0
		},
		{
			"name": "FIN2704",
			"moduleCode": "FIN",
			"semester": "Y2S1",
			"title": "Finance",
			"description": "A broad overview of the financial environment under which a firm operates (Topics covered: introduction to finance, financial statement analysis, long-term financial planning, time value of money, risk and return analysis, capital budgeting methods and applications, common stock valuation, bond valuation, short term management and financing)",
			"review": "An introduction to time value of money and its variety of applications in a plethora of subjects to determine the worthiness of taking up a project.",
			"grade": "A+",
			"type": "BBA",
			"moduleCredit": 4.0
		},
		{
			"name": "BT2102",
			"moduleCode": "BT",
			"semester": "Y2S1",
			"title": "Data Management and Visualisation",
			"description": "Provides practical knowledge and understanding of basic issues and techniques in data management and warehousing with relational database management systems, as well as data visualisation principles, techniques and tools",
			"review": null,
			"grade": "B+",
			"type": "BZA",
			"moduleCredit": 4.0
		},
		{
			"name": "BT2101",
			"moduleCode": "BT",
			"semester": "Y2S1",
			"title": "Econometrics Modelling for Business Analytics",
			"description": "Provides foundations to econometrics and the use of software tools to perform econometrics data analysis (analysis models, including regression, time series regression, dynamic causal effects among others)",
			"review": null,
			"grade": "A+",
			"type": "BZA",
			"moduleCredit": 4.0
		},
		{
			"name": "CS2040",
			"moduleCode": "CS",
			"semester": "Y2S1",
			"title": "Data Structures and Algorithms",
			"description": "Introduction to design and implementation of fundamental data structures and algorithms [basic data structures (linked lists, stacks, queues, hash tables, binary heaps, trees, and graphs), searching and sorting algorithms, and basic analysis of algorithms]",
			"review": null,
			"grade": "A+",
			"type": "BZA",
			"moduleCredit": 4.0
		},
		{
			"name": "CP2106 (Orbital)",
			"moduleCode": "CP",
			"semester": "Y1S2",
			"title": "Independent Software Development Project (Orbital)",
			"description": "Provides a platform for students to gain hands-on industrial experience for computing technologies related to students’ own interests",
			"review": null,
			"grade": "CS",
			"type": "BZA",
			"moduleCredit": 4.0
		},
		{
			"name": "Code Signal",
			"moduleCode": null,
			"semester": "Y1S2",
			"title": null,
			"description": null,
			"review": null,
			"grade": null,
			"type": null,
			"moduleCredit": null
		},
		{
			"name": "AutoTrader",
			"moduleCode": null,
			"semester": "Y1S2",
			"title": null,
			"description": null,
			"review": null,
			"grade": null,
			"type": null,
			"moduleCredit": null
		},
		{
			"name": "UTC1706G",
			"moduleCode": "UTC",
			"semester": "Y1S2",
			"title": "Thinking in systems: Markets and Inequality",
			"description": "Introduction to Systems Thinking and provides an analytical framework to analyse real world events in markets through the use of software such as Vensim",
			"review": null,
			"grade": "CS",
			"type": "Both",
			"moduleCredit": 4.0
		},
		{
			"name": "MKT1705B",
			"moduleCode": "MKT",
			"semester": "Y1S2",
			"title": "Principles of Marketing",
			"description": "Provides a conceptual framework to analyse and interpret marketing phenomena and to suggest courses of action in response to marketing problems (Topics: the marketing concept, the marketing environment and the marketing mix which includes product, pricing, distribution and promotion)",
			"review": null,
			"grade": "S",
			"type": "BBA",
			"moduleCredit": 4.0
		},
		{
			"name": "HSI1000",
			"moduleCode": "HSI",
			"semester": "Y1S2",
			"title": "How Science Works, Why Science Works",
			"description": "A module taken to fulfil the requirement of an interdisciplinary module. Hones the skills needed to negotiate a world in the post-truth era, derived from the scientific method",
			"review": null,
			"grade": "A",
			"type": "BZA",
			"moduleCredit": 4.0
		},
		{
			"name": "BSP1702",
			"moduleCode": "BSP",
			"semester": "Y1S2",
			"title": "Legal Environment of Business",
			"description": "Equips us with basic legal knowledge relating to commercial transactions so that we will be more aware of potential legal problems which may arise in the course of business and having become aware, to have recourse to such professional legal advice as is necessary in the circumstances (Topics: Singapore Legal System, mediation and arbitration to resolve disputes, the types of various business organisations for businesses to conduct effectively within the law, directors' duties & liabilities, the making of valid business contracts and the rights & obligations of traders in the market place and negligence in the business environment through misstatements)",
			"review": null,
			"grade": "A",
			"type": "BBA",
			"moduleCredit": 4.0
		},
		{
			"name": "NTU Asset Management",
			"moduleCode": "CC",
			"semester": "Y1S2",
			"title": null,
			"description": null,
			"review": null,
			"grade": null,
			"type": null,
			"moduleCredit": 0.0
		},
		{
			"name": "MA1521",
			"moduleCode": "MA",
			"semester": "Y1S2",
			"title": "Calculus for Computing",
			"description": "Basic foundation for calculus and its related subjects required by computing students, also covering simple mathematical modeling techniques and numerical methods in connection with ordinary differential equations (Topics: Preliminaries on sets and number systems, Calculus of functions of one variable and applications, Sequences, series and power series, Functions of several variables, Extrema, First and second order differential equations, Basic numerical methods for ordinary differential equations)",
			"review": null,
			"grade": "A",
			"type": "BZA",
			"moduleCredit": 4.0
		},
		{
			"name": "ES2002",
			"moduleCode": "ES",
			"semester": "Y1S2",
			"title": "Business Communication for Leaders",
			"description": "Equips us with the business communication skills needed to be recognized as leaders among stakeholders – colleagues, superiors, and customers/clients (Core principles emphasised: audience-centred, objective-driven, and context-sensitive communication; intentional, reflective and mindful communication; oral communication fundamentals of verbal, vocal, visual and aural skills; and the 7 C’s of effective business communication)",
			"review": null,
			"grade": "A",
			"type": "BBA",
			"moduleCredit": 4.0
		},
		{
			"name": "MNO1706A",
			"moduleCode": "MNO",
			"semester": "Y1S2",
			"title": "Organisational Behaviour",
			"description": "Introduce students to human behaviour in organisational contexts. (Topics: Examining processes at the individual, group and organisational levels)",
			"review": null,
			"grade": "S",
			"type": "BBA",
			"moduleCredit": 4.0
		},
		{
			"name": "Future Economy Forum",
			"moduleCode": "CC",
			"semester": "Y1S2",
			"title": null,
			"description": null,
			"review": null,
			"grade": null,
			"type": null,
			"moduleCredit": 0.0
		},
		{
			"name": "ACC1701",
			"moduleCode": "ACC",
			"semester": "Y1S2",
			"title": "Accounting for Decision Makers",
			"description": "Introduction to accounting from a user perspective. Financial reporting is covered from the viewpoint of an external investor. Book-keeping and preparation of financial statements are also covered at an introductory level.",
			"review": null,
			"grade": "A+",
			"type": "Both",
			"moduleCredit": 4.0
		},
		{
			"name": "UTW1001M",
			"moduleCode": "UTW",
			"semester": "Y1S1",
			"title": "Sport and Competition",
			"description": "A module taken in RC4 (Residential College 4) that introduced thesis research and writing as well as covered the various arguments and theological perspectives on sport and competition in today’s world - including functionalist theory, conflict theory, interactionist theory, critical theory and feminist theory",
			"review": null,
			"grade": "S",
			"type": "Both",
			"moduleCredit": 4.0
		},
		{
			"name": "IS1108",
			"moduleCode": "IS",
			"semester": "Y1S1",
			"title": "Digital Ethics and Data Privacy",
			"description": "Introduces students to the issues of digital ethics and data privacy faced by individuals and organisations. Addresses challenges in balancing technological desirability with social desirability while developing digital products and services, including Professional Ethics, Computing for Social Good, Digital Ethics by Design, Digital Intellectual Property Rights, Automation and Autonomous Systems, and Artificial Intelligence Ethics and Governance",
			"review": null,
			"grade": "S",
			"type": "BZA",
			"moduleCredit": 4.0
		},
		{
			"name": "BSP1703",
			"moduleCode": "BSP",
			"semester": "Y1S1",
			"title": "Managerial Economics",
			"description": "Provides basic working knowledge of contemporary economic thinking (Topics: market equilibrium, competition, monopoly, price and non-price business strategies)",
			"review": null,
			"grade": "A+",
			"type": "BBA",
			"moduleCredit": 4.0
		},
		{
			"name": "MA2001",
			"moduleCode": "MA",
			"semester": "Y1S1",
			"title": "Linear Algebra I",
			"description": "Introduction to fundamental concepts of linear algebra and investigated in the context of the Euclidean spaces R^n. Proofs of results presented in the concrete setting (Topics: Systems of linear equations, matrices, determinants, Euclidean spaces, linear combinations and linear span, subspaces, linear independence, bases and dimension, rank of a matrix, inner products, eigenvalues and eigenvectors, diagonalisation, linear transformations between Euclidean spaces, applications)",
			"review": null,
			"grade": "A",
			"type": "BZA",
			"moduleCredit": 4.0
		},
		{
			"name": "BT1101",
			"moduleCode": "BT",
			"semester": "Y1S1",
			"title": "Introduction to Business Analytics",
			"description": "Provides us with an introduction to the fundamental concepts and tools needed to understand the emerging role of business analytics and data science applications in business and non-profit organisations. Students will learn how to apply basic business analytics and data science/analytics tools (such as R) to large real-life datasets in different contexts, and how to effectively use and interpret analytic models and results for making better and more well-informed business decisions.",
			"review": null,
			"grade": "A",
			"type": "BZA",
			"moduleCredit": 4.0
		},
		{
			"name": "Canvas",
			"moduleCode": null,
			"semester": null,
			"title": null,
			"description": null,
			"review": null,
			"grade": null,
			"type": null,
			"moduleCredit": null
		},
		{
			"name": "CS2030",
			"moduleCode": "CS",
			"semester": "Y1S1",
			"title": "Programming Methodology II",
			"description": "Explores two modern programming paradigms, object-oriented programming and functional programming. We learnt to develop medium-scale software programs using object oriented design principles and advanced programming constructs available in the two paradigms (Topics: objects and classes, composition, association, inheritance, interface, polymorphism, abstract classes, dynamic binding, lambda expression, effect-free programming, first class functions, closures, continuations, monad)",
			"review": null,
			"grade": "A",
			"type": "BZA",
			"moduleCredit": 4.0
		},
		{
			"name": "STR1000",
			"moduleCode": "STR",
			"semester": "Y1S1",
			"title": "Career Creation Starter Workshops",
			"description": "The Starter Workshops are part of the Career Creation suite of training programmes designed to impart year 1 undergraduates with the core skills needed to prepare for their careers. The workshops take students through early and in-depth career planning and train them in the concrete skills necessary for their eventual internship and job search. The Starter Workshops comprise of the following: 1. Career Planning – How to Create Your Future 2. Personal Branding – How the World Knows You 3. Networking – How to Build Your Tribe 4. Resume Crafting – How to Impress on Paper 5. Interviewing – How to Showcase Yourself",
			"review": null,
			"grade": "CS",
			"type": "BBA",
			"moduleCredit": 0.0
		},
		{
			"name": "BPM1705",
			"moduleCode": "BPM",
			"semester": "Y1S1",
			"title": "Understanding How Business Works",
			"description": "This module introduces new students to the nuts and bolts of the business functions of finance, human resource management, marketing and operations management. It allows students to have insights into how these functional areas work together for a business to function and grow. This module will take students through the journey of a new business from business idea conception to funding and commercialisation.",
			"review": null,
			"grade": "CS",
			"type": "BBA",
			"moduleCredit": 0.0
		},
		{
			"name": "CS1010",
			"moduleCode": "CS",
			"semester": "Y1S1",
			"title": "Programming Methodology",
			"description": "Introduces the fundamental concepts of problem solving by computing and programming using an imperative programming language (Topics: computational thinking and computational problem solving, designing and specifying an algorithm, basic problem formulation and problem solving approaches, program development, coding, testing and debugging, fundamental programming constructs (variables, types, expressions, assignments, functions, control structures, etc.), fundamental data structures (arrays, strings, composite data types), basic sorting, and recursion)",
			"review": null,
			"grade": "Exempted",
			"type": "BZA",
			"moduleCredit": 4.0
		}
	]
}
